fbiego/Lumia-ESP32/src/main.cpp
      cfg.pin_cs = 15;   // Pin number to which CS is connected (-1 = disable)
      cfg.pin_rst = 22;  // pin number where RST is connected (-1 = disable)
      cfg.pin_busy = -1; // pin number to which BUSY is connected (-1 = disable)

      // * The following setting values ​​are set to general default values ​​for each panel, and the pin number (-1 = disable) to which BUSY is connected, so please try commenting out any unknown items.

      cfg.memory_width = 320;  // Maximum width supported by driver IC
      cfg.memory_height = 480; // Maximum height supported by driver IC
      cfg.panel_width = 320;   // actual displayable width
      cfg.panel_height = 480;  // actual displayable height
      cfg.offset_x = 0;        // Panel offset in X direction
      cfg.offset_y = 0;        // Panel offset in Y direction
      cfg.offset_rotation = 0;
      cfg.dummy_read_pixel = 8;
      cfg.dummy_read_bits = 1;
      cfg.readable = false;
      cfg.invert = false;
      cfg.rgb_order = false;
      cfg.dlen_16bit = false;
      cfg.bus_shared = false;

      _panel_instance.config(cfg);
    }

    {                                      // Set backlight control. (delete if not necessary)
      auto cfg = _light_instance.config(); // Get the structure for backlight configuration.

      cfg.pin_bl = 23;     // pin number to which the backlight is connected
      cfg.invert = false;  // true to invert backlight brightness
      cfg.freq = 44100;    // backlight PWM frequency
      cfg.pwm_channel = 1; // PWM channel number to use

      _light_instance.config(cfg);
      _panel_instance.setLight(&_light_instance); // Sets the backlight to the panel.
    }

    // { // Configure settings for touch screen control. (delete if not necessary)
    //    auto cfg = _touch_instance.config();

    //    cfg.x_min = 0;    // Minimum X value (raw value) obtained from the touchscreen
    //    cfg.x_max = 319;  // Maximum X value (raw value) obtained from the touchscreen
    //    cfg.y_min = 0;    // Minimum Y value obtained from touchscreen (raw value)
    //    cfg.y_max = 479;  // Maximum Y value (raw value) obtained from the touchscreen
    //    cfg.pin_int = 36; // pin number to which INT is connected
    //    cfg.bus_shared = false;
    //    cfg.offset_rotation = 0;

    //    // For I2C connection
    //    cfg.i2c_port = 0;    // Select I2C to use (0 or 1)
    //    cfg.i2c_addr = 0x38; // I2C device address number
    //    cfg.pin_sda = 18;    // pin number where SDA is connected
    //    cfg.pin_scl = 19;    // pin number to which SCL is connected
    //    cfg.freq = 400000;   // set I2C clock

    //    _touch_instance.config(cfg);
    //    _panel_instance.setTouch(&_touch_instance); // Set the touchscreen to the panel.
    // }

    setPanel(&_panel_instance); // Sets the panel to use.
  }
};

struct TouchData
{
  int xpos;
  int ypos;
  int event;
} touch_data;

#include "FT6336U.h"

FT6336U ft6336u(18, 19, -1, 36);

#endif

// Create an instance of the prepared class.
LGFX tft;


static lv_color_t disp_draw_buf[screenWidth * SCR];
static lv_color_t disp_draw_buf2[screenWidth * SCR];

ESP32Time rtc(3 * 3600);
WiFiMulti wifiMulti;
HTTPClient http;


// AppComponent testApp[] = {
//     {.id = 0, .parent = 0, .type = LABEL, .text = "Hello world", .xPos = 20, .yPos = 20, .width = 25, .height = 25},
//     {.id = 1, .parent = 0, .type = BUTTON, .text = "Click", .xPos = 20, .yPos = 70, .width = 100, .height = 10},
//     {.id = 2, .parent = 0, .type = SLIDER, .text = "", .xPos = 20, .yPos = 150, .width = 250, .height = 5},
//     {.id = 3, .parent = 0, .type = SWITCH, .text = "", .xPos = 20, .yPos = 250, .width = 50, .height = 20},
//     {.id = 4, .parent = 0, .type = LABEL, .text = "Test app", .xPos = 20, .yPos = 300, .width = 25, .height = 25},
// };

uint8_t ext[] = {
    // APP DATA
    0xA0, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0x54, 0x65, 0x73, 0x74, 0x20, 0x41, 0x70, 0x70, 0x00,

    // UI COMPONENTS
    // d, type, comp id   , parent id ,    x pos  ,    y pos  ,   width  ,   height   , text ..... terminator
    0xAA, 0x01, 0x10, 0x01, 0xAB, 0x01, 0x00, 0x14, 0x00, 0x14, 0x00, 0x19, 0x00, 0x19, 0x48, 0x65, 0x6c, 0x6c, 0x6f, 0x20, 0x77, 0x6f, 0x72, 0x6c, 0x64, 0x00,
    0xAA, 0x02, 0x10, 0x02, 0xAB, 0x01, 0x00, 0x14, 0x00, 0x46, 0x00, 0x64, 0x00, 0x00, 0x43, 0x6c, 0x69, 0x63, 0x6b, 0x00,
    0xAA, 0x05, 0x10, 0x03, 0xAB, 0x01, 0x00, 0x14, 0x00, 0x96, 0x00, 0xFA, 0x00, 0x05, 0x00,
    0xAA, 0x07, 0x10, 0x04, 0xAB, 0x01, 0x00, 0x14, 0x00, 0xFA, 0x00, 0x32, 0x00, 0x14, 0x00,
    0xAA, 0x01, 0x10, 0x05, 0xAB, 0x01, 0x00, 0x14, 0x01, 0x2C, 0x00, 0x19, 0x00, 0x19, 0x4c, 0x6f, 0x72, 0x65, 0x6d, 0x20, 0x69, 0x70, 0x73, 0x75, 0x6d, 0x20, 0x64, 0x6f, 0x6c, 0x6f, 0x72, 0x20, 0x0a, 0x73, 0x69, 0x74, 0x20, 0x61, 0x6d, 0x65, 0x74, 0x2c, 0x20, 0x63, 0x6f, 0x6e, 0x73, 0x65, 0x63, 0x74, 0x65, 0x74, 0x75, 0x72, 0x20, 0x0a, 0x61, 0x64, 0x69, 0x70, 0x69, 0x73, 0x63, 0x69, 0x6e, 0x67, 0x20, 0x65, 0x6c, 0x69, 0x74, 0x2e, 0x00};

AppComponent testApp[10];

void gsmHandler();

void extractApp(uint8_t *data, int size)
{

  int a = 0, i = 0, j, z = size;
  uint8_t buf[100];
  while (1)
  {
    // copy component data to buffer
    for (j = 0; j < 14; j++)
    {
      if (i >= z)
      {
        break; // not enough data for component
      }
      buf[j] = data[i];
      i++;
    }
    while (1)
    {
      buf[j] = data[i];
      j++;
      i++;
      if (buf[j - 1] == 0x00)
      {
        break; // component terminator found
      }
      if (i >= z)
      {
        break; // component terminator not found & end of component data
      }
    }
    if (buf[j - 1] != 0x00)
    {
      break; // component incomplete
    }

    // component info was loaded to buffer
    if (buf[0] == 0xAA)
    {
      testApp[a].type = (Type)buf[1];
      testApp[a].id = buf[2] << 8 | buf[3];
      testApp[a].parent = buf[4] << 8 | buf[5];
      testApp[a].xPos = buf[6] << 8 | buf[7];
      testApp[a].yPos = buf[8] << 8 | buf[9];
      testApp[a].width = buf[10] << 8 | buf[11];
      testApp[a].height = buf[12] << 8 | buf[13];
      strncpy(testApp[a].text, (char *)buf + 14, j - 14);
      printf("App UI Component > 0x%X\n", uuid(testApp[a].parent, testApp[a].id));
      a++;
    }
    else if (buf[0] == 0xA0)
    {
      char appName[20];
      strncpy(appName, (char *)buf + 14, j - 14);
      printf("App Name %s\n", appName);
    }
  }
}

/* Display flushing */
void my_disp_flush(lv_disp_drv_t *disp, const lv_area_t *area, lv_color_t *color_p)
{
  if (tft.getStartCount() == 0)
  {
    tft.endWrite();
  }

