fbiego/Lumia-ESP32/src/main.cpp
  tft.pushImageDMA(area->x1, area->y1, area->x2 - area->x1 + 1, area->y2 - area->y1 + 1, (lgfx::swap565_t *)&color_p->full);

  lv_disp_flush_ready(disp); /* tell lvgl that flushing is done */
}

/*Read the touchpad*/
void my_touchpad_read(lv_indev_drv_t *indev_driver, lv_indev_data_t *data)
{
#ifdef PLUS
  uint16_t touchX, touchY;

  bool touched = tft.getTouch(&touchX, &touchY);

  if (!touched)
  {
    data->state = LV_INDEV_STATE_REL;
  }
  else
  {
    data->state = LV_INDEV_STATE_PR;

    /*Set the coordinates*/
    data->point.x = touchX;
    data->point.y = touchY;
    currentMillis = millis();
  }
#else
  data->point.x = touch_data.xpos;
  data->point.y = touch_data.ypos;

  if (touch_data.event == 1)
  {
    data->state = LV_INDEV_STATE_PR;
    currentMillis = millis();
  }
  else
  {
    data->state = LV_INDEV_STATE_REL;
  }
#endif
}

void requestResult(int requestCode, int statusCode, String payload, long time)
{

  Serial.printf("Request %d received, time %dms, code: %d\n", requestCode, time, statusCode);

  if (statusCode == HTTP_CODE_OK)
  {
    Serial.println(payload);
  }

  switch (requestCode)
  {
  case TIME_REQUEST:
    if (statusCode == HTTP_CODE_OK)
    {
      DynamicJsonDocument json(100);
      deserializeJson(json, payload);
      long t = json["timestamp"].as<long>();
      rtc.setTime(t);
    }
    break;
  case APPS_REQUEST:
    if (statusCode == HTTP_CODE_OK)
    {
      DynamicJsonDocument json(2048);
      deserializeJson(json, payload);
      JsonArray array = json.as<JsonArray>();
      int x = 0;

      for (JsonVariant j : array)
      {
        JsonObject v = j.as<JsonObject>();
        String name = v["name"].as<String>();
        strncpy(appList[x].name, name.c_str(), name.length() + 1);
        appList[x].id = v["id"].as<uint32_t>();
        appList[x].version = v["version"].as<uint32_t>();
        appList[x].size = v["size"].as<uint32_t>();
        appList[x].state = true;
        x++;

        if (x >= MAX_APPS)
        {
          break;
        }
      }
    }
    break;
  }
}

void sendRequest(void *parameter)
{
  long t;

  for (int r = 0; r < MAX_REQUEST; r++)
  {
    if (request[r].active)
    {
      t = millis();
      http.begin(request[r].url);
      int httpCode;
      if (request[r].method)
      {
        httpCode = http.POST(request[r].data);
      }
      else
      {
        httpCode = http.GET();
      }

      String payload = http.getString();

      // http.end();
      t = millis() - t;
      requestResult(request[r].code, httpCode, payload, t);
      request[r].active = false;
    }
  }
  http.end();
  activeRequest = false;
  // When you're done, call vTaskDelete. Don't forget this!
  vTaskDelete(NULL);
}

void connectWiFi(void *parameter)
{
  uint8_t status;
  while (true)
  {
    status = wifiMulti.run();
    Serial.printf("WiFi trying: %d\n", status);
    if (status == WL_CONNECTED || status == WL_CONNECT_FAILED || status == WL_DISCONNECTED || status == WL_NO_SSID_AVAIL)
    {
      break;
    }
  }
  Serial.printf("WiFi exit: %d\n", status);
  // When you're done, call vTaskDelete. Don't forget this!
  vTaskDelete(NULL);
}

bool runRequest()
{
  // returns true if the task was created
  // returns false if the previous task has not completed, new one cannot be created
  if (!activeRequest)
  {
    activeRequest = true;
    // xTaskCreatePinnedToCore(
    xTaskCreate(
        sendRequest,     // Function that should be called
        "HTTP Requests", // Name of the task (for debugging)
        8192,            // Stack size (bytes)
        NULL,            // Parameter to pass
        1,               // Task priority
        NULL
        // NULL,               // Task handle
        // 1
    );

    return true;
  }
  else
  {
    return false;
  }
}

void getNVSData()
{
  String val;
  val = NVS.getString("ssid1");
  strncpy(ssid1, val.c_str(), val.length() + 1);
  val = NVS.getString("ssid2");
  strncpy(ssid2, val.c_str(), val.length() + 1);
  val = NVS.getString("ssid3");
  strncpy(ssid3, val.c_str(), val.length() + 1);
  val = NVS.getString("ssid4");
  strncpy(ssid4, val.c_str(), val.length() + 1);
  val = NVS.getString("ssid5");
  strncpy(ssid5, val.c_str(), val.length() + 1);
  val = NVS.getString("pass1");
  strncpy(pass1, val.c_str(), val.length() + 1);
  val = NVS.getString("pass2");
  strncpy(pass2, val.c_str(), val.length() + 1);
  val = NVS.getString("pass3");
  strncpy(pass3, val.c_str(), val.length() + 1);
  val = NVS.getString("pass4");
  strncpy(pass4, val.c_str(), val.length() + 1);
  val = NVS.getString("pass5");
  strncpy(pass5, val.c_str(), val.length() + 1);
  brightness = NVS.getInt("brightness", brightness);
  themeColor = NVS.getInt("theme", themeColor);
  screenTime = (long)NVS.getInt("screentime", (uint32_t)screenTime);

  NVS.getBlob("passCode", passcode.code, 4);
  passcode.set = NVS.getInt("passSet", 0) != 0;

  printf("loaded screentime %d\n", screenTime);

  Serial.printf("Passcode loaded %s - %d%d%d%d\n", passcode.set ? "ON" : "OFF", passcode.code[0], passcode.code[1], passcode.code[2], passcode.code[3]);
}

void setWifi()
{
  wifiMulti.addAP(ssid1, pass1);
  wifiMulti.addAP(ssid2, pass2);
  wifiMulti.addAP(ssid3, pass3);
  wifiMulti.addAP(ssid4, pass4);
  wifiMulti.addAP(ssid5, pass5);

  String wifiList = "Saved Wifi";
  wifiList += "\n1. " + String(ssid1);
  wifiList += "\n2. " + String(ssid2);
  wifiList += "\n3. " + String(ssid3);
  wifiList += "\n4. " + String(ssid4);
  wifiList += "\n5. " + String(ssid5);

  lv_label_set_text(ui_appWifiList, wifiList.c_str());
}

void saveWifiList()
{
  setWifi();
  NVS.setString("ssid1", String(ssid1));
  NVS.setString("ssid2", String(ssid2));
  NVS.setString("ssid3", String(ssid3));
  NVS.setString("ssid4", String(ssid4));
  NVS.setString("ssid5", String(ssid5));
  NVS.setString("pass1", String(pass1));
  NVS.setString("pass2", String(pass2));
  NVS.setString("pass3", String(pass3));
  NVS.setString("pass4", String(pass4));
  NVS.setString("pass5", String(pass5));
}

void saveSettings()
{
  NVS.setInt("brightness", brightness);
  NVS.setInt("theme", themeColor);
  NVS.setBlob("passCode", passcode.code, 4);
  NVS.setInt("passSet", passcode.set ? 1 : 0);
  NVS.setInt("screentime", (uint32_t)screenTime);
  Serial.printf("Passcode set %s - %d%d%d%d\n", passcode.set ? "ON" : "OFF", passcode.code[0], passcode.code[1], passcode.code[2], passcode.code[3]);
  printf("saved screentime %d\n", screenTime);
}

lv_obj_t *create_component(lv_obj_t *parent, AppComponent component)
{
  lv_obj_t *object;
  printf("Comp %d, x:%d, y:%d > %s\n", component.type, component.xPos, component.yPos, &component.text);
  if (component.type == LABEL)
  {
    object = create_label(parent, component.text, component.yPos);
  }
  else if (component.type == BUTTON)
  {
    object = create_button(parent, uuid(component.parent, component.id), component.text, component.xPos, component.yPos, component.width, component.height);
  }
  else if (component.type == SLIDER)
  {
    object = create_slider(parent, uuid(component.parent, component.id), component.xPos, component.yPos, component.width, component.height);
  }
  else if (component.type == SWITCH)
  {
    object = create_switch(parent, uuid(component.parent, component.id), component.xPos, component.yPos);
  }
  else
  {
    object = NULL;
  }

  return object;
}

void loadLocalApp(const char *path, int &size)
{
  Serial.printf("Reading file: %s\r\n", path);
  int z = 0;
  File file = SPIFFS.open(path);
  if (!file || file.isDirectory())
  {
    Serial.println("- failed to open file for reading");
    return;
  }
  Serial.println("- read from file:");
  while (file.available())
  {
    Serial.write(file.read());
    z++;
  }
  file.close();
}

void loadTestApp()
{
  size_t n = 10;
  appSize = n;
  extractApp(ext, sizeof(ext) / sizeof(ext[0]));

  closeApp();

  lv_obj_t *container = app_canvas();

