fbiego/Lumia-ESP32/src/main.cpp
  for (int i = 0; i < n; i++)
  {
    if (testApp[i].parent != 0)
    {
      activeApp[i] = create_component(container, testApp[i]);
    }
  }

  launchApp("Test App", &ui_img_gear_png, true);
}

void deep_sleep()
{

  vibrate(100);

  tft.setBrightness(0);

  esp_sleep_enable_ext0_wakeup(WAKE_PIN, 0); // 1 = High, 0 = Low

  // Go to sleep now
  Serial.println("Going to deep sleep now");
  esp_deep_sleep_start();
}

void wakeup_reason()
{
  esp_sleep_wakeup_cause_t wakeup_reason;

  wakeup_reason = esp_sleep_get_wakeup_cause();

  switch (wakeup_reason)
  {
  case ESP_SLEEP_WAKEUP_EXT0:
    Serial.println("Wakeup caused by external signal using RTC_IO");
    break;
  case ESP_SLEEP_WAKEUP_EXT1:
    Serial.println("Wakeup caused by external signal using RTC_CNTL");
    break;
  case ESP_SLEEP_WAKEUP_TIMER:
    Serial.println("Wakeup caused by timer");
    break;
  case ESP_SLEEP_WAKEUP_TOUCHPAD:
    Serial.println("Wakeup caused by touchpad");
    break;
  case ESP_SLEEP_WAKEUP_ULP:
    Serial.println("Wakeup caused by ULP program");
    break;
  default:
    Serial.printf("Wakeup was not caused by deep sleep: %d\n", wakeup_reason);
    rtc.setTime(1663491331); // Sunday, September 18, 2022 8:55:31 AM
    break;
  }
}

void light_sleep()
{

  // digitalWrite(MOTOR, LOW);
  tft.setBrightness(0);
  openLock();

  esp_sleep_enable_ext0_wakeup(WAKE_PIN, 0); // 1 = High, 0 = Low

  // Go to sleep now
  Serial.println("Going to light sleep now");
  esp_light_sleep_start();
}

void setup()
{
  Serial.begin(115200);

#ifdef GSM
  GSM.begin(115200, SERIAL_8N1, 26, 25);
#endif

  tft.init();
  tft.initDMA();
  tft.startWrite();

#ifndef PLUS
  ft6336u.begin();

  pinMode(MOTOR, OUTPUT);
  digitalWrite(MOTOR, LOW);
#endif


  NVS.begin();

  getNVSData();

  if (!SPIFFS.begin(FORMAT_SPIFFS_IF_FAILED))
  {
    Serial.println("SPIFFS Mount Failed");
    tft.setBrightness(brightness);

    delay(2000);
    ESP.restart();
  }

  wakeup_reason();

  lv_init();

  Serial.print("Width: ");
  Serial.print(screenWidth);
  Serial.print("\tHeight: ");
  Serial.println(screenHeight);

  // if (psramFound())
  // {
  //   disp_draw_buf = (lv_color_t *)ps_malloc(sizeof(lv_color_t) * screenWidth * 10);
  //   disp_draw_buf2 = (lv_color_t *)ps_malloc(sizeof(lv_color_t) * screenWidth * 10);
  // }
  // else
  // {
  //   disp_draw_buf = (lv_color_t *)malloc(sizeof(lv_color_t) * screenWidth * 10);
  //   disp_draw_buf2 = (lv_color_t *)malloc(sizeof(lv_color_t) * screenWidth * 10);
  // }

  if (!disp_draw_buf)
  {
    Serial.println("LVGL disp_draw_buf allocate failed!");
  }
  else
  {

    Serial.print("Display buffer size: ");

    lv_disp_draw_buf_init(&draw_buf, disp_draw_buf, disp_draw_buf2, screenWidth * SCR);

    /* Initialize the display */
    lv_disp_drv_init(&disp_drv);
    /* Change the following line to your display resolution */
    disp_drv.hor_res = screenWidth;
    disp_drv.ver_res = screenHeight;
    disp_drv.flush_cb = my_disp_flush;
    disp_drv.draw_buf = &draw_buf;
    lv_disp_drv_register(&disp_drv);

    /* Initialize the input device driver */
    static lv_indev_drv_t indev_drv;
    lv_indev_drv_init(&indev_drv);
    indev_drv.type = LV_INDEV_TYPE_POINTER;
    indev_drv.read_cb = my_touchpad_read;
    lv_indev_drv_register(&indev_drv);

    ui_init();

    // lv_disp_load_scr(ui_lockScreen);

    Serial.println("Setup done");
  }
  tft.setBrightness(brightness);
  currentMillis = millis();
  while (currentMillis + 2000 > millis())
  {
    lv_timer_handler();
  }
  vibrate(200);
  openLock();
  setWifi();
  currentMillis = millis();

  xTaskCreate(
      connectWiFi,    // Function that should be called
      "WIFI Connect", // Name of the task (for debugging)
      8192,           // Stack size (bytes)
      NULL,           // Parameter to pass
      1,              // Task priority
      NULL);

  uint64_t mac = ESP.getEfuseMac();
  // Serial.print("Mac: ");

  // for (int i = 0; i < 6; i++)
  // {
  //   if (i > 0)
  //   {
  //     Serial.print(":");
  //   }
  //   Serial.print(byte(mac >> (i * 8) & 0xFF), HEX);
  // }
  // Serial.println();

  String info = "";

  info += "\nChip model: " + String(ESP.getChipModel());
  info += "\nChip cores: " + String(ESP.getChipCores());
  info += "\nChip frequency: " + String(ESP.getCpuFreqMHz()) + "Mhz";
  info += "\nChip version: " + String(ESP.getChipRevision());

  info += "\nRAM size: " + String((ESP.getHeapSize() / 1024.0), 0) + "kB";
  info += "\nPSRAM size: " + String((ESP.getPsramSize() / (1024.0 * 1024.0)), 0) + "MB";

  info += "\nFlash size: " + String((ESP.getFlashChipSize() / (1024.0 * 1024.0)), 0) + "MB";
  info += "\nFlash speed: " + String((ESP.getFlashChipSpeed() / 1000000.0), 0) + "Mhz";

  info += "\nSDK version: " + String(ESP.getSdkVersion());
  info += "\nFirmware size: " + String((ESP.getSketchSize() / (1024.0 * 1024.0)), 0) + "MB";
  info += "\nStorage space: " + String((SPIFFS.totalBytes() / (1024.0 * 1024.0)), 0) + "MB";
  info += "\nMAC address: ";

  for (int i = 0; i < 6; i++)
  {
    if (i > 0)
    {
      info += "-";
    }
    info += String(byte(mac >> (i * 8) & 0xFF), HEX);
  }
  // info += "\nScreen resolution: " + String(screenWidth) + "x" + String(screenHeight);
  // info += "\nScreen model: " ;
  // info += "\nTouch model: FT6336U" ;

  Serial.println(info);

  uint32_t total = ESP.getFlashChipSize();
  int free = SPIFFS.totalBytes() - SPIFFS.usedBytes();
  int used = total - free;
  String usage = String(used / (1024.0 * 1024.0), 2) + " MB used out of " + String(total / (1024.0 * 1024.0), 2) + " MB";

  lv_bar_set_value(ui_storageBar, int((used / (total * 1.0)) * 100.0), LV_ANIM_OFF);
  lv_label_set_text(ui_storageText, usage.c_str());
  lv_slider_set_value(ui_brightnessSlider, brightness, LV_ANIM_OFF);
  lv_colorwheel_set_rgb(ui_themeWheel, lv_color_hex(themeColor));
  lv_event_send(ui_themeWheel, LV_EVENT_VALUE_CHANGED, NULL);
  lv_label_set_text(ui_aboutText, info.c_str());

  for (int j = 0; j < 4; j++)
  {
    if (timeouts[j] == screenTime)
    {
      lv_dropdown_set_selected(ui_timeoutSelect, j);
      printf("Selected %d\n", j);
      break;
    }
  }

