fbiego/Lumia-ESP32/src/main.cpp
  request[0].active = true;
  request[0].method = false;
  request[0].code = TIME_REQUEST;
  request[0].url = "https://iot.fbiego.com/api/v1/time";

  request[1].active = true;
  request[1].method = false;
  request[1].code = APPS_REQUEST;
  request[1].url = "https://iot.fbiego.com/esp32/apps";

  Serial.println("Device ready");
}

void loop()
{

#ifndef PLUS
  touch_data.event = ft6336u.read_td_status();
  touch_data.xpos = ft6336u.read_touch1_x();
  touch_data.ypos = ft6336u.read_touch1_y();
#endif
  lv_timer_handler(); /* let the GUI do its work */
  delay(5);

  if (currentMillis + screenTime < millis())
  {
    if (activeRequest)
    {
      printf("requests are active\n");
      tft.setBrightness(0);
    }
    else
    {
      printf("timeout: going to sleep\n");
      light_sleep();
    }
  }
  else
  {

    rtcTime.day = rtc.getDay();
    rtcTime.month = rtc.getMonth() + 1;
    rtcTime.year = rtc.getYear();

    tft.setBrightness(brightness);

    if (WiFi.isConnected())
    {
      lv_obj_clear_flag(ui_wifiIcon, LV_OBJ_FLAG_HIDDEN);
      if (!onConnect)
      {
        Serial.println("WiFi Connected");
        runRequest();
        onConnect = true;
      }
    }
    else
    {
      onConnect = false;
      lv_obj_add_flag(ui_wifiIcon, LV_OBJ_FLAG_HIDDEN);
    }
    lv_label_set_text(ui_lockScreenTime, rtc.getTime("%H:%M").c_str());
    lv_label_set_text(ui_lockTime, rtc.getTime("%H:%M").c_str());
    lv_label_set_text(ui_lockScreenDate, rtc.getTime("%A, %B %d").c_str());
    lv_label_set_text(ui_actionDate, rtc.getTime("%m/%d").c_str());
  }

  if (Serial.available())
  {
    String cmd = Serial.readStringUntil('\n');
    if (cmd == "MSG")
    {
      showNotification("Message", &ui_img_237043237, "Serial\nMessage from serial port");
    }
    if (cmd == "CALL")
    {
      showCaller("Serial", "", true);
    }
  }
  gsmHandler();
}

void gsmHandler()
{
#ifdef GSM
  if (GSM.available())
  {
    uint8_t buf[50];
    int ln = GSM.readBytes(buf, 50);
    Serial.printf("GSM data len %d\n", ln);

    switch (buf[0])
    {
    case 0xAA:
      if (buf[1] == 0x00)
      {
        Serial.println("No simcard");
      }
      if (buf[1] == 0x01)
      {
        Serial.println("GSM Ready");
      }
      if (buf[1] == 0x02)
      {
        Serial.println("Network Registered");
      }
      break;
    case 0xAB:
      if (buf[1] == 0xC0)
      {
        Serial.printf("Dial State: %d, code %d\n", buf[2], buf[3]);
      }
      if (buf[1] == 0xC1)
      {
        Serial.printf("Hang up: %d, code %d\n", buf[2], buf[3]);
        lv_obj_add_flag(ui_callerScreen, LV_OBJ_FLAG_HIDDEN);
        endVibrate();
      }
      if (buf[1] == 0xC2)
      {
        Serial.printf("Incoming call \n");
        showCaller("Caller", "", true);
      }
      if (buf[1] == 0xC3)
      {
        Serial.println("Answer Success");
      }
      break;
    }
  }
#endif
}

void callFunction(uint8_t type)
{
#ifdef GSM
  switch (type)
  {
  case 0x00:
    GSM.write(0xC0);
    break;
  case 0x01:
    GSM.write(0xC1);
    break;
  case 0x02:
    GSM.write(0xC2);
    break;
  }
#endif
}